Methuku Samhitha

In [21]:
import pandas as pd

In [22]:
from google.colab import drive
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [23]:
DatasetBaseFolder = '/content/gdrive/MyDrive/ColabNotebooks/PandasTI/Datasets/'

In [25]:
df = pd.read_csv(DatasetBaseFolder+'Anual Balenced Sheet.csv')
df.head()

      Year       Institutional_sector_name  ...   Status  Values
0  2008.03  Corporate business enterprises  ...  REVISED  225544
1  2009.03  Corporate business enterprises  ...  REVISED  243315
2  2010.03  Corporate business enterprises  ...  REVISED  259381
3  2011.03  Corporate business enterprises  ...  REVISED  262596
4  2012.03  Corporate business enterprises  ...  REVISED  267100

[5 rows x 8 columns]

In [26]:
##Shape
df.shape

(18720, 8)

In [27]:
#describe
df.describe()

               Year  Institutional_sector_code
count  18720.000000               18720.000000
mean    2012.530000                 260.722222
std        2.872358                 144.607845
min     2008.030000                   8.000000
25%     2010.030000                 211.000000
50%     2012.530000                 246.000000
75%     2015.030000                 312.000000
max     2017.030000                 611.000000

In [31]:
df.Institutional_sector_code.unique()

array([141,  27, 281, 311, 312, 321, 411, 511,   8, 611, 121, 211, 221,
       222, 231, 241, 251, 261])

In [32]:
df.Institutional_sector_code.value_counts()

511    1040
222    1040
321    1040
211    1040
611    1040
261    1040
231    1040
311    1040
8      1040
312    1040
121    1040
281    1040
27     1040
251    1040
411    1040
141    1040
221    1040
241    1040
Name: Institutional_sector_code, dtype: int64

In [33]:
df.corr()

                                   Year  Institutional_sector_code
Year                       1.000000e+00               6.582981e-18
Institutional_sector_code  6.582981e-18               1.000000e+00